{"text": "@evelynvwoodsen on a flight somewhere &amp; need last min place? AllTheRooms has couches, Airbnbs, hotels... everything https://t.co/FT3ebbcTZ1 @BCATomCliff The use of Helium in Scuba Diving Tanks\nhttp://t.co/SfnzzDwd2n\n#BCAGa31 #SolutionsChemistry A great paper to request about He and Henry's Law.\nhttp://t.co/YZb0tKmjdJ\n#BCAGa31 Wonder how hybrid batteries work? Read this intro to learn what the effects of the Lanthanum shortage are: http://t.co/876sH83QjR\n#BCAGa31 Final post on chemistry of the uses of REE in shortage. Neodymium is used in wind turbines.\nhttp://t.co/7jwa8WJCb1\n#BCAGa31 What would happen if we ran out of Europium, a REE in shortage used in LEDs? How do LEDs work?\nhttp://t.co/sJb0AuiqNw\n#BCAGa31 Lanthanum, a rare earth element (REE) used in hybrid cars, is just one of the REE that are in shortage\nhttp://t.co/WoshWyASzZ\n#BCAGa31 Does China control the price for Rare Earth Metals?\nWhat can we do about the shortage?\n#BCAGa31\nhttp://t.co/QIHj19ZTMO Dexamethasone Sodium Phosphate Injection. Long name and long list of uses... currently on shortage\nhttp://t.co/93L9B5Dgch\n#BCAGa31 A shortage that is nearly unheard of: Drugs\nAre your prescription drugs on back-ordered?\nhttp://t.co/Jd82H4nnW0\n#BCAGa31 Some really interesting and cool facts about Plutonium - has videos, mini articles and is interactive\nhttp://t.co/DmeGOl0EPu\n#BCAGa31 @BCATomCliff Perhaps a good start to our second blog post? \n#BCAGa31 Patents play a huge role in Pharmacology\nHere's a patent for the synthesis of LSD filed in 1948\nhttp://t.co/AZg8waZ5wi\n@BCATomCliff #BCAGa31 A chance to continue Neuropharmacology..\nI have found the holy grail of Chemistry in Pharmacology:\nhttp://t.co/yF0BzSTwXg     \n#BCAGA31 It seems as if Neuroelectrophysiology has both some chemistry and physics components to it.\nHow fMRIs work: http://t.co/E89GWnayVF\n#BCAGa31 Have a headache?\nCheck out the synthesis of aspirin at\nhttp://t.co/21SZvmmzz3\n#BCAGa31 Narrowing the scope for future blogs: How does caffeine work?\nhttp://t.co/3MOdxW5A0r\nhttp://t.co/yzF0utfysn\n#BCAGa31 #Stimulants #Caffeine Everything you could possibly want to know about drugs and their effect on the brain #BCAGa31 #FirstBlogPost\nhttp://t.co/UBmyoXapGJ Think @neuroscience is a good theme? Here are some links to see if you're interested\nhttp://t.co/WnispJd92S \nhttp://t.co/7viC1Jz75A\n#BCAGa31 Think of the number of physical arrangements with 100 billion neurons..Quite a bit of entropy! What about @neuroscience as a theme? #BCAGa31"}